In [2]:
print('저의 주피터 서버에 오신 것을 환영합니다.')

저의 주피터 서버에 오신 것을 환영합니다.

In [3]:
print('2번째 셀 실행')

2번째 셀 실행

# 내가 제목

## 나는 누구지?

* 나는 누구지
* 나는 두번째 목록
* 나는 세번째 목록

# 나는 큰 제목
## 나는 더 작은 제목
### 나는 더더 작은 제목

* 아침식사
* 점심식사
* 저녁식사
    * 우동
    * 라면

*나는 삐뚤어질거야*
**나는 찐해질거야**
***나는 찐하게 삐뚤어질거야***

In [10]:
import pandas as pd

In [20]:
df_2010 = pd.read_csv("../data/2010.csv", encoding='utf-8')
df_2011 = pd.read_csv("../data/2011.csv", encoding='utf-8')
df_2012 = pd.read_csv("../data/2012.csv", encoding='utf-8')

In [25]:
df_2010

   국어  영어  수학
0  50  88  99
1  77  20  80
2  80  70  77
3  60  60  88
4  70  44  10

In [26]:
df_2011

   국어  영어   수학
0  11  55  100
1  88  33   66
2  55  11   44
3  44  55   88
4  22  11   45

In [27]:
df_2012

   국어  영어   수학
0  89  23   63
1  65  65   15
2  35   8   84
3  74  45   99
4  15  52  100

In [40]:
total_jumsu = pd.concat([df_2010, df_2011, df_2012], ignore_index=True)  #합치기. 합칠때 기존 인덱스 무시하기.

In [35]:
total_jumsu

    국어  영어   수학
0   50  88   99
1   77  20   80
2   80  70   77
3   60  60   88
4   70  44   10
5   11  55  100
6   88  33   66
7   55  11   44
8   44  55   88
9   22  11   45
10  89  23   63
11  65  65   15
12  35   8   84
13  74  45   99
14  15  52  100

In [37]:
total_jumsu['국어']

0     50
1     77
2     80
3     60
4     70
5     11
6     88
7     55
8     44
9     22
10    89
11    65
12    35
13    74
14    15
Name: 국어, dtype: int64

In [39]:
total_jumsu.iloc[0]  #첫번째 인스턴스의 행을 가져옴. 특정인덱스로 슬라이싱을 함. loc=location

국어    50
영어    88
수학    99
Name: 0, dtype: int64

In [42]:
total_jumsu.iloc[0:2] #0~1까지 범위로 슬라이싱

   국어  영어  수학
0  50  88  99
1  77  20  80

In [44]:
total_jumsu.iloc[:,0]  #iloc[행,열], iloc[행] 두가지임으로 열만 가져오고싶을때도 행을 비울 수 없음.

0     50
1     77
2     80
3     60
4     70
5     11
6     88
7     55
8     44
9     22
10    89
11    65
12    35
13    74
14    15
Name: 국어, dtype: int64

In [45]:
df_concat1 = pd.read_csv("../data/concat_1.csv")
df_concat2 = pd.read_csv("../data/concat_2.csv")
df_concat3 = pd.read_csv("../data/concat_3.csv")

In [46]:
df_concat1

    A   B   C   D
0  a0  b0  c0  d0
1  a1  b1  c1  d1
2  a2  b2  c2  d2
3  a3  b3  c3  d3

In [47]:
df_concat2

    E   F   G   H
0  a4  b4  c4  d4
1  a5  b5  c5  d5
2  a6  b6  c6  d6
3  a7  b7  c7  d7

In [48]:
df_concat3

     A    C    F    H
0   a8   b8   c8   d8
1   a9   b9   c9   d9
2  a10  b10  c10  d10
3  a11  b11  c11  d11

In [55]:
total_concat = pd.concat([df_concat1, df_concat2, df_concat3], sort=True, ignore_index=True)

In [56]:
total_concat

      A    B    C    D    E    F    G    H
0    a0   b0   c0   d0  NaN  NaN  NaN  NaN
1    a1   b1   c1   d1  NaN  NaN  NaN  NaN
2    a2   b2   c2   d2  NaN  NaN  NaN  NaN
3    a3   b3   c3   d3  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   a4   b4   c4   d4
5   NaN  NaN  NaN  NaN   a5   b5   c5   d5
6   NaN  NaN  NaN  NaN   a6   b6   c6   d6
7   NaN  NaN  NaN  NaN   a7   b7   c7   d7
8    a8  NaN   b8  NaN  NaN   c8  NaN   d8
9    a9  NaN   b9  NaN  NaN   c9  NaN   d9
10  a10  NaN  b10  NaN  NaN  c10  NaN  d10
11  a11  NaN  b11  NaN  NaN  c11  NaN  d11

In [61]:
total_concat.iloc[0:1]  #행 인덱스0부터0까지

    A   B   C   D    E    F    G    H
0  a0  b0  c0  d0  NaN  NaN  NaN  NaN

In [65]:
total_concat.iloc[:,4]  #index=4열

0     NaN
1     NaN
2     NaN
3     NaN
4      a4
5      a5
6      a6
7      a7
8     NaN
9     NaN
10    NaN
11    NaN
Name: E, dtype: object

In [66]:
total_concat.iloc[0]  # index가 0인 행 인스턴스

A     a0
B     b0
C     c0
D     d0
E    NaN
F    NaN
G    NaN
H    NaN
Name: 0, dtype: object

In [67]:
total_concat.iloc[0:5]

     A    B    C    D    E    F    G    H
0   a0   b0   c0   d0  NaN  NaN  NaN  NaN
1   a1   b1   c1   d1  NaN  NaN  NaN  NaN
2   a2   b2   c2   d2  NaN  NaN  NaN  NaN
3   a3   b3   c3   d3  NaN  NaN  NaN  NaN
4  NaN  NaN  NaN  NaN   a4   b4   c4   d4

In [68]:
total_concat.iloc[:,0:2]  #index=0.1인 열 슬라이싱

      A    B
0    a0   b0
1    a1   b1
2    a2   b2
3    a3   b3
4   NaN  NaN
5   NaN  NaN
6   NaN  NaN
7   NaN  NaN
8    a8  NaN
9    a9  NaN
10  a10  NaN
11  a11  NaN

In [73]:
row_append = df_concat1.append(df_concat2, ignore_index=True, sort=False)
row_append

     A    B    C    D    E    F    G    H
0   a0   b0   c0   d0  NaN  NaN  NaN  NaN
1   a1   b1   c1   d1  NaN  NaN  NaN  NaN
2   a2   b2   c2   d2  NaN  NaN  NaN  NaN
3   a3   b3   c3   d3  NaN  NaN  NaN  NaN
4  NaN  NaN  NaN  NaN   a4   b4   c4   d4
5  NaN  NaN  NaN  NaN   a5   b5   c5   d5
6  NaN  NaN  NaN  NaN   a6   b6   c6   d6
7  NaN  NaN  NaN  NaN   a7   b7   c7   d7

In [74]:
row_append.columns

Index(['A', 'B', 'C', 'D', 'E', 'F', 'G', 'H'], dtype='object')

In [78]:
inner_result = pd.concat([df_concat1,df_concat2,df_concat3], join ='inner') # 공통적인 항목만 가져옴
inner_result

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 0, 1, 2, 3, 0, 1, 2, 3]

In [80]:
inner_result2 = pd.concat([df_concat1,df_concat3], join ='inner')
inner_result2

     A    C
0   a0   c0
1   a1   c1
2   a2   c2
3   a3   c3
0   a8   b8
1   a9   b9
2  a10  b10
3  a11  b11